GitConverter/src/InformationRegisters/ИнформацияПользователей/ИнформацияПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформацияПользователей</name>
  <resources>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Хранилище</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GitConverter/src/CommonModules/КонвертацияХранилищаПовтИсп/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

#Область ПрограммныйИнтерфейс

// Возвращает значение константы МаксимальноеКоличествоЧастичныхВыгрузокПодряд.
Функция МаксимальноеКоличествоЧастичныхВыгрузокПодряд() Экспорт
	Количество = Константы.МаксимальноеКоличествоЧастичныхВыгрузокПодряд.Получить();
	Возврат ?(Количество = 0, 10, Количество);
КонецФункции

// Возвращает информацию о пользователе - email и имя в git.
Функция ИнформацияОПользователе(Хранилище, Пользователь) Экспорт
	Результат = Новый Структура("EMail, ИмяGit", "", ""); // Значения по умолчанию.
	Если ПустаяСтрока(Пользователь) Тогда
		Возврат Результат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Хранилище", Хранилище);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Регистр.Хранилище = &Хранилище КАК ЭтоХранилище,
	|	Регистр.Email КАК Email,
	|	Регистр.Имя КАК Имя
	|ИЗ
	|	РегистрСведений.ИнформацияПользователей КАК Регистр
	|ГДЕ
	|	Регистр.Пользователь = &Пользователь
	|	И Регистр.Хранилище В (&Хранилище, ЗНАЧЕНИЕ(Справочник.ХранилищаКонфигураций.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоХранилище УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.EMail = Выборка.Email;
		Результат.ИмяGit = Выборка.Имя;
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Возвращает полное имя файла программного интерфейса EDT.
Функция ФайлПрограммногоИнтерфейсаEDT(ВерсияEDTCLI = Неопределено, КаталогEDT = Неопределено) Экспорт
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВерсийEDT") И ЗначениеЗаполнено(ВерсияEDTCLI) Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВерсияEDTCLI, "ПутьКCLI");
	Иначе
		Результат = "";
	КонецЕсли;
	Если Результат = "" Или Не ОбщегоНазначения.ФайлСуществует(Результат) Тогда
		Если КаталогEDT = Неопределено Тогда
			КаталогEDT = Константы.КаталогEDT.Получить();
		КонецЕсли;
		Если ЗначениеЗаполнено(КаталогEDT) Тогда
			КаталогEDT = ОбщегоНазначения.ПолноеИмяКаталога(КаталогEDT, Истина, Ложь);
		Иначе
			КаталогEDT = "";
		КонецЕсли;
		Если ОбщегоНазначенияПовтИсп.ЭтоWindowsСервер() Тогда
			Результат = КаталогEDT + "1cedtcli.exe";
		Иначе
			Результат = КаталогEDT + "1cedtcli";
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Возвращает значение константы ВерсияПлатформы, если она не заполнена - версию платформы текущего сеанса.
Функция ВерсияПлатформыПоУмолчанию() Экспорт
	ВерсияПлатформы = Константы.ВерсияПлатформы.Получить();
	Если Не ЗначениеЗаполнено(ВерсияПлатформы) Тогда
		ВерсияПлатформы = ОбщегоНазначения.ВерсияПлатформы();
	КонецЕсли;
	Возврат ВерсияПлатформы;
КонецФункции

#КонецОбласти
